{"title":"Top 10 carry jobs","description":"Who carried their team to the finals with the least help?","hed":"The biggest NBA carry jobs in league history","dek":"Who carried their team to the finals with the least help?","intro":[{"type":"text","value":"Despite being a team sport, some NBA teams rely on a star to get them to the finals more than others. Did Giannis do it without help? <em>Not really</em>. Did MJ carry Pippen? <em>Sometimes</em>. Is LeBron amazing? <em>Yes</em>."},{"type":"text","value":"There are plenty of opinionated articles and videos debating this already. So I figured I would add my data-driven take to the mix. What do “the numbers” say about ranking the biggest playoff carry jobs in NBA history?"},{"type":"text","value":"Without burying the lede, <strong>the biggest carry job ever was LeBron’s (losing) effort with Cleveland in 2018</strong>."}],"listId":"lebron","listCaption":"Artistic interpretation of LeBron carrying Korver (amongst others).","listPost":[{"type":"text","value":"Hard to argue with that. But let’s pump the brakes on the rest of them. While I thought there was going to be a simple journey to the “answer,” that wasn’t the case. So we are going to take a little detour into the method here. Or <a href=#rankings>jump ahead</a> and explore the rankings."}],"method":[{"decision":"What part of the season should be included?","text":"My journey started out easy: look at an entire season or just the playoffs? I spent little time here. Despite the downside of smaller sample sizes, the playoffs got at the essence of things for me, who turned it on when it mattered the most.","result":"Playoffs"},{"decision":"Which teams?","text":"This was a bit tricker. At first I thought about restricting it to champs. But there are arguably more cases where a player didn’t have enough support to win, but still had a Herculean effort to almost win the title. It felt wrong to not consider those.","result":"Finalists"},{"decision":"Rate or cumulative stats?","text":"Now the metric, there are a lot, and they can all be great and terrible. There is more variety with rate stats, but even including minute thresholds I don’t think it gets at the heart of the question. Someone playing lights out for 20 minutes a game just won’t have the same impact as someone playing 40. Quantity matters in the playoffs.","result":"Cumulative stats"},{"decision":"Which cumulative stat to use?","text":"There some old guards, like Win Shares and Value Over Replacement Player. I opted for a newer one. It came down to two things: shiny new things with a fancy blog post, and eye test.","result":"RAPTOR WAR","chart":"stat-table"},{"decision":"How can we use this stat to decide if a player carried their team?","text":"This went through a few iterations. 1. Delta (con: more games+minutes = higher potential). 2. highest % share vs rest of team (con: two high players, AD/Bron). 3. Delta Share (con: harder to communicate). 4. Pie Share (Yes). 5. 2 v 3 v5.","result":"Compare their share of WAR against the top X other players","chart":"attempts","idea":"show scatter plots with big heads highlighting counter-examples"}],"chart":"top-10-table","Chart":"explorable scatter plot","Conclusion":"How did we do?"}